Repository: Nekrich/GlobalMessageService-iOS
Catalog: Resources/Core/*.lproj/GlobalMessageServiceErrors.strings
Languages: ru, uk

# MessageFetcher.NoPhone
source: Subscriber has no phone number
ru: У абонента не указан телефонный номер
uk: У абонента не вказан телефонний номер

# MessageFetcher.CoreDataSaveError
source: %@. Can't save messages
ru: Ошибка при сохранении сообщения: %@
uk: Помилка при збереженні повідомлення: %@

# Request.Error
source: HTTP request error: %@
ru: Ошибка HTTP запроса: %@
uk: Помилка HTTP запиту: %@

# Request.UnknownError
source: HTTP request unknown error
ru: Неизвестная ошибка HTTP запроса
uk: Невідома помилка HTTP запиту

# ResultParsing.CantRepresentResultAsDictionary
source: Wrong result format
ru: Неверный формат ответа сервера
uk: Невірний формат відповіді сервера

# ResultParsing.NoStatus
source: No operation status flag
ru: Отсутствует флаг статуса выполненной операции
uk: Відсутній флаг статуса виконаної операції

# ResultParsing.StatusIsFalse
source: Failed. %@
ru: Ошибка. %@
uk: Помилка. %@

# ResultParsing.UnknownError
source: Result parser error
ru: Ошибка разбора ответа от сервера
uk: Помилка розбору відповіді від сервера

# AddSubscriber.NoAppDeviceId
source: No requested Global Message Service token
ru: Отсутствует ожидаемый токен Global Message Service
uk: Не отримано очікуваний токен Global Message Service

# AddSubscriber.AppDeviceIdWrondType
source: Wrong Global Message Service token type
ru: Не верный тип токена Global Message Service
uk: Не вірний тип токена Global Message Service

# AddSubscriber.AppDeviceIdLessOrEqualZero
source: Global Message Service token less or equal zero
ru: Токен Global Message Service меньше или равен нулю
uk: Токен Global Message Service менший або дорівнює нулю

source: Another task in progress: add subscriber
ru: Выполняется другой запрос: реєстрація абонента
uk: Виконується інший запит: реєстрація абонента

# AnotherTaskInProgress.UpdateSubscriber
source: Another task in progress: ubdate subscriber info
ru: Выполняется другой запрос: обновление информации абонента
uk: Виконується інший запит: оновлення інформації абонента

# AnotherTaskInProgress.UpdateGCMToken
source: Another task in progress: ubdate Google Cloud Messaging token
ru: Выполняется другой запрос: получение токена Global Message Service
uk: Виконується інший запит: отримання токену Global Message Service

# GlobalMessageServiceError.GMSTokenIsNotSet
source: Global Message Service token is not set
ru: Не установлено значение токена Global Message Service
uk: Не встановлене значення токена Global Message Service

# GlobalMessageServiceError.GCMTokenIsNotSet
source: No Google Cloud Messaging token
ru: Отсутствует токен Google Cloud Messaging
uk: Немає токена Google Cloud Messaging

# GlobalMessageServiceError.UnknownError
source: Unknown error
ru: Неизвестная ошибк
uk: Невідома помилка
